Hey @rossmpersonal 👋 Thank you for taking the time to raise this! My initial thought was that supplying the alias name as the key ID for the policy was being accepted by the upstream API and would set the policy on the key itself, but on read, that the upstream API would return the key ID rather than the alias name, resulting in a diff. On trying to reproduce, however, I wasn't able to achieve the results you mentioned. 

I had to update your example configuration slightly to provide a valid policy in the `aws_kms_key_policy` resource, as follows:

<details>
<summary>Click to expand updated configuration</summary>

```hcl
resource "aws_kms_key_policy" "policy" {
  key_id = aws_kms_alias.alias.name
  policy = jsonencode({
    Id = "example"
    Statement = [
      {
        Action = "kms:*"
        Effect = "Allow"
        Principal = {
          AWS = "*"
        }

        Resource = "*"
        Sid      = "Enable IAM User Permissions"
      },
    ]
    Version = "2012-10-17"
  })
  bypass_policy_lockout_safety_check = false
}

resource "aws_kms_alias" "alias" {
  name          = "alias/whatever"
  target_key_id = aws_kms_key.key.key_id
}

resource "aws_kms_key" "key" {
  description                        = "whatever"
  key_usage                          = "ENCRYPT_DECRYPT"
  customer_master_key_spec           = "SYMMETRIC_DEFAULT"
  bypass_policy_lockout_safety_check = false
  deletion_window_in_days            = 30
  is_enabled                         = true
  enable_key_rotation                = true
  rotation_period_in_days            = 90
  multi_region                       = false
}
```
</details>

After doing so, I attempted to apply the configuration, which errored:

<details>
<summary>Click to expand log output</summary>

```console
$ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_alias.alias will be created
  + resource "aws_kms_alias" "alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/whatever"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.key will be created
  + resource "aws_kms_key" "key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "whatever"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + rotation_period_in_days            = 90
      + tags_all                           = (known after apply)
    }

  # aws_kms_key_policy.policy will be created
  + resource "aws_kms_key_policy" "policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = "alias/whatever"
      + policy                             = jsonencode(
            {
              + Id        = "example"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_kms_key.key: Creating...
aws_kms_key.key: Creation complete after 5s [id=aaee4b9d-8098-48ce-b3ff-724d639f3cb4]
aws_kms_alias.alias: Creating...
aws_kms_alias.alias: Creation complete after 0s [id=alias/whatever]
aws_kms_key_policy.policy: Creating...
╷
│ Error: updating KMS Key Policy (alias/whatever) policy: operation error KMS: PutKeyPolicy, https response error StatusCode: 400, RequestID: 3f72ca13-7262-4dee-be0e-5a8deab63934, InvalidArnException: Key Aliases are not supported for this operation.
│
│   with aws_kms_key_policy.policy,
│   on main.tf line 14, in resource "aws_kms_key_policy" "policy":
│   14: resource "aws_kms_key_policy" "policy" {
│
╵
```
</details>

If I updated the configuration to instead set:

```hcl
resource "aws_kms_key_policy" "policy" {
  key_id = aws_kms_alias.alias.target_key_id
  # ...other config
}
```

The apply went through without issue and additional applies didn't indicate that an update was required. Can you review this information and let me know if I've missed any crucial details?